app/controllers/guests_controller.rb

  def edit
    @guest = current_account.guests.find(params[:id])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 1 AND (`guests`.account_id = 1))

  def update
    @guest = Guest.find(params[:id])

    respond_to do |format|
      format.html {
        @guest.update_attributes(params[:guest])
---
SELECT * FROM `guests` WHERE (`guests`.`id` = 1 AND (`guests`.account_id = 1))
UPDATE `guests` SET `updated_at` = '2009-06-25 22:29:05', `first_name` = 'Jason' WHERE `id` = 1