app/controllers/reservations_controller.rb

  def edit
    @reservation = current_account.reservations.find(params[:id])
---
SELECT * FROM `reservations` WHERE (`reservations`.`id` = 1 AND (`reservations`.account_id = 1))

  def update
     @reservation = current_account.reservations.find(params[:id])

      respond_to do |format|
        format.html {
          @reservation.update_attributes(params[:reservation])
---
SELECT * FROM `reservations` WHERE (`reservations`.`id` = 1 AND (`reservations`.account_id = 1))
UPDATE `reservations` SET `updated_at` = '2009-06-26 01:21:55', `start_date` = '2009-06-24', `end_date` = '2009-06-27' WHERE `id` = 2

  def show
    @reservation = current_account.reservations.find(params[:id])
---
SELECT * FROM `reservations` WHERE (`reservations`.`id` = 1 AND (`reservations`.account_id = 1))