app/controllers/reservations_controller.rb

SELECT * FROM `units` WHERE (`units`.account_id = 1)
SELECT * FROM `reservations` WHERE (account_id = 1 && ((start_date between '2009-07-01' and '2009-07-15' || end_date between '2009-07-01' and '2009-07-15') || (start_date < '2009-07-01' && end_date > '2009-07-15'))) AND (`reservations`.account_id = 1)
---
  def index
    @start = (params[:qd]) ? Date.parse(params[:qd]) : @start = Date.today
    @units = current_account.units.all
    @reservations = current_account.reservations.find_for_calendar(@start + 1.days, current_account.id)