app/controllers/units_controller.rb

  def index
    if params[:start_date] && params[:end_date]
      arrival = params[:start_date]
      departure = params[:end_date]

      @units = current_account.units.available Date.parse(arrival).to_s, Date.parse(departure).to_s
    else
      @units = current_account.units.all
---
SELECT * FROM `units` WHERE (`units`.account_id = 1) ORDER BY name

  def show
    @unit = current_account.units.find(params[:id])
---
SELECT * FROM `units` WHERE (`units`.`id` = 1 AND (`units`.account_id = 1))

  def edit
    @unit = current_account.units.find(params[:id])
---
SELECT * FROM `units` WHERE (`units`.`id` = 1 AND (`units`.account_id = 1))

  def update
     @unit = current_account.units.find(params[:id])

      respond_to do |format|
        format.html {
          @unit.update_attributes(params[:unit])
---
SELECT * FROM `units` WHERE (`units`.`id` = 1 AND (`units`.account_id = 1))
UPDATE `units` SET `updated_at` = '2009-06-25 21:48:37', `name` = 'Appalachian Suite' WHERE `id` = 1